
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Изображения · Sputnik</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="JavaScript/Readme.html" />
    
    
    <link rel="prev" href="CSS/Stylus.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">Оглавление</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    Разметка
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Markup/HTML.html">
            
                <a href="Markup/HTML.html">
            
                    
                    HTML
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Markup/Jade.html">
            
                <a href="Markup/Jade.html">
            
                    
                    Jade
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="CSS/Readme.html">
            
                <a href="CSS/Readme.html">
            
                    
                    CSS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                    Методологии
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="CSS/Methodology/BEM.html">
            
                <a href="CSS/Methodology/BEM.html">
            
                    
                    BEM
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="CSS/Stylus.html">
            
                <a href="CSS/Stylus.html">
            
                    
                    Stylus
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="Images.html">
            
                <a href="Images.html">
            
                    
                    Изображения
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="JavaScript/Readme.html">
            
                <a href="JavaScript/Readme.html">
            
                    
                    JavaScript
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="JavaScript/Plugins.html">
            
                <a href="JavaScript/Plugins.html">
            
                    
                    Библиотеки
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Git/Readme.html">
            
                <a href="Git/Readme.html">
            
                    
                    Git
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="Git/Aliases.html">
            
                <a href="Git/Aliases.html">
            
                    
                    Aliases
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="Git/Convention.html">
            
                <a href="Git/Convention.html">
            
                    
                    Cоглашение по именованию
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Soft/Readme.html">
            
                <a href="Soft/Readme.html">
            
                    
                    Soft
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" >
            
                <span>
            
                    
                    Редакторы и IDE
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1.1" data-path="Soft/Editors/Plugins.html">
            
                <a href="Soft/Editors/Plugins.html">
            
                    
                    Плагины
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.1.2" data-path="Soft/Editors/EditorConfig.html">
            
                <a href="Soft/Editors/EditorConfig.html">
            
                    
                    EditorConfig
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="Useful Services.html">
            
                <a href="Useful Services.html">
            
                    
                    Полезные сервисы
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Изображения</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;-&#x438;-&#x438;&#x445;-&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;">&#x418;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x438;&#x445; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;</h1>
<h2 id="&#x440;&#x430;&#x441;&#x442;&#x440;">&#x420;&#x430;&#x441;&#x442;&#x440;</h2>
<p>&#x421; &#x432;&#x44B;&#x440;&#x435;&#x437;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x440;&#x430;&#x441;&#x442;&#x440;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x430;&#x435;&#x442;.
&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x430;&#x44E;&#x442; &#x432; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x430;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432;.
&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x435; 2 &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x430; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439;: JPG &#x438; PNG.
&#x412; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C; &#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x435; &#x444;&#x43E;&#x442;&#x43E;&#x433;&#x440;&#x430;&#x444;&#x438;&#x438; &#x438;&#x43B;&#x438; &#x444;&#x43E;&#x43D;&#x44B;.
&#x412; PNG - &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x438;, &#x432;&#x441;&#x435; &#x447;&#x442;&#x43E; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x437;&#x440;&#x430;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438;.</p>
<h2 id="&#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;-&#x440;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x432;&#x44B;&#x445;-&#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439;">&#x41E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x440;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x432;&#x44B;&#x445; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439;</h2>
<p>&#x41A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x438; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;.
&#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x441;&#x442;&#x43E;&#x438;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; Save for Web &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C; Adobe Photoshop.
&#x417;&#x430;&#x442;&#x435;&#x43C;, &#x434;&#x43B;&#x44F; JPG &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; JPEGMini: &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; <a href="http://www.jpegmini.com/main/shrink_photo" target="_blank">&#x43D;&#x430; &#x441;&#x430;&#x439;&#x442;&#x435;</a>
&#x438;&#x43B;&#x438; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x43D;&#x43E;&#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x434;&#x43E; 20 &#x444;&#x43E;&#x442;&#x43E;&#x433;&#x440;&#x430;&#x444;&#x438;&#x439; &#x432; &#x434;&#x435;&#x43D;&#x44C;,
&#x44D;&#x442;&#x43E; &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E;, &#x432;&#x43F;&#x43E;&#x43B;&#x43D;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x43D;&#x447;&#x43D;&#x43E;. &#x42D;&#x43A;&#x43E;&#x43D;&#x43E;&#x43C;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x434;&#x43E;&#x441;&#x442;&#x438;&#x433;&#x430;&#x442;&#x44C; 50-500%.
&#x414;&#x43B;&#x44F; PNG &#x435;&#x441;&#x442;&#x44C; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441; <a href="https://tinypng.com" target="_blank">TinyPNG</a>. &#x421;&#x443;&#x442;&#x44C; &#x437;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x433;&#x43B;&#x443;&#x431;&#x438;&#x43D;&#x430; &#x446;&#x432;&#x435;&#x442;&#x430; &#x441; 24 &#x431;&#x438;&#x442; &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x430; 8 &#x431;&#x438;&#x442;.
&#x422;.&#x435;. &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x433;&#x43E; 256 &#x446;&#x432;&#x435;&#x442;&#x43E;&#x432;, &#x43D;&#x43E; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x438;&#x43A;&#x43E;&#x43D;&#x43E;&#x43A; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x447;&#x435;&#x43C; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E;.
&#x41F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x44D;&#x43A;&#x43E;&#x43D;&#x43E;&#x43C;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x432;&#x434;&#x432;&#x43E;&#x435;-&#x432;&#x442;&#x440;&#x43E;&#x435;.
&#x41D;&#x435;&#x442; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x430; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x43E;&#x439;&#x434;&#x443;&#x442; &#x432; &#x441;&#x43F;&#x440;&#x430;&#x439;&#x442;, &#x43D;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x43C;&#x44B;&#x441;&#x43B; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x441;&#x43F;&#x440;&#x430;&#x439;&#x442; &#x446;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;.
TinyPNG &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x435;&#x43D; &#x432; &#x432;&#x438;&#x434;&#x435; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430; &#x434;&#x43B;&#x44F; Grunt &#x438; Gulp, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x432; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x43C; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x435;,
&#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x43E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x2014; 500 &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43E;&#x43A; &#x432; &#x43C;&#x435;&#x441;&#x44F;&#x446;.</p>
<h2 id="&#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;-&#x432;-adobe-illustartor">&#x412;&#x435;&#x43A;&#x442;&#x43E;&#x440; &#x432; Adobe Illustartor</h2>
<p>&#x412;&#x435;&#x43A;&#x442;&#x43E;&#x440; &#x438;&#x437; AI &#x2013; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x438; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; AI &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43D;&#x435;&#x442; &#x442;&#x43E;&#x436;&#x435;.
&#x41E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; Vector Smart Object &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x43C; AI (&#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43D;&#x43E;&#x435; &#x43C;&#x435;&#x43D;&#x44E; &#x441;&#x43B;&#x43E;&#x44F; &#x2014; &#x420;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x438;&#x440;&#x432;&#x43E;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; / Edit Contents)
&#x438; &#x43E;&#x442;&#x442;&#x443;&#x434;&#x430; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x432; SVG. &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x43B;&#x43B;&#x44E;&#x441;&#x442;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x437; Photoshop
&#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x432; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; AI &#x444;&#x430;&#x439;&#x43B; (&#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43A;&#x441;&#x442;&#x43D;&#x43E;&#x435; &#x43C;&#x435;&#x43D;&#x44E; &#x441;&#x43B;&#x43E;&#x44F; &#x2013; &#x42D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x433;&#x43E; / Export Contents)
&#x438; &#x441;&#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; SVG &#x2013; <a href="https://cloudconvert.org/ai-to-svg" target="_blank">https://cloudconvert.org/ai-to-svg</a>.
&#x41D;&#x43E; &#x442;&#x443;&#x442; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x444;&#x430;&#x439;&#x43B; &#x446;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x435; &#x43D;&#x430;&#x431;&#x43E;&#x440;&#x44B; &#x438;&#x43A;&#x43E;&#x43D;&#x43E;&#x43A; &#x432;&#x44B;&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x441;&#x44F;.</p>
<h2 id="&#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;-&#x432;-&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x445;-photoshop">&#x412;&#x435;&#x43A;&#x442;&#x43E;&#x440; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x445; Photoshop</h2>
<p>&#x424;&#x43E;&#x440;&#x43C;&#x44B; (shape) &#x2014; &#x44D;&#x442;&#x43E; &#x43B;&#x443;&#x447;&#x448;&#x438;&#x439; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C; &#x441;&#x430;&#x43C;&#x438;&#x43C; Photoshop,
&#x435;&#x441;&#x43B;&#x438; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; CC &#x438;&#x43B;&#x438; CC2014 &#x2013; <a href="http://creativedroplets.com/generate-svg-with-photoshop-cc-beta/" target="_blank">http://creativedroplets.com/generate-svg-with-photoshop-cc-beta/</a>.
&#x41B;&#x438;&#x431;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x44B; (&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x44B;&#x435;) &#x2014; Zeick &#x438; SVG Hero. &#x412;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E;, &#x43D;&#x43E; &#x432; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43A;&#x43E;&#x43D;&#x432;&#x440;&#x435;&#x442;&#x43D;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43B;&#x430;&#x433;&#x430;&#x442;&#x44C;
&#x438; &#x432;&#x44B;&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C; SVG, &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; PNG &#x432; BASE64. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x441;&#x430;&#x43C; Photoshop &#x43D;&#x435; &#x443;&#x43C;&#x435;&#x435;&#x442; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x43F;&#x43A;&#x438; &#x448;&#x435;&#x439;&#x43F;&#x43E;&#x432;.
&#x41F;&#x43E; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C; &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x438;. &#x422;&#x430;&#x43A;&#x438;&#x435; &#xAB;&#x43A;&#x440;&#x438;&#x432;&#x44B;&#x435;&#xBB; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x438; &#x43C;&#x430;&#x43B;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E; &#x43D;&#x435; &#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;,
&#x432;&#x435;&#x441;&#x44F;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x447;&#x435;&#x43C; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x439; png, &#x442;&#x430;&#x43A; &#x435;&#x449;&#x435; &#x438; &#x43D;&#x435; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43C;&#x43E;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x438;&#x43A;&#x430;&#x445; &#x438; &#x432; &#x441;&#x430;&#x444;&#x430;&#x440;&#x438;.</p>
<h2 id="&#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;-&#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x43D;&#x44B;&#x445;-&#x438;&#x43A;&#x43E;&#x43D;&#x43E;&#x43A;">&#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x43D;&#x44B;&#x445; &#x438;&#x43A;&#x43E;&#x43D;&#x43E;&#x43A;</h2>
<p>&#x421;&#x430;&#x43C;&#x44B;&#x439; &#x43B;&#x443;&#x447;&#x448;&#x438;&#x439; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; &#x2014; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43D;&#x44B;&#x439; SVG, &#x432;&#x43D;&#x435;&#x434;&#x440;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x432; HTML-&#x440;&#x430;&#x437;&#x43C;&#x435;&#x442;&#x43A;&#x443;.
&#x42D;&#x442;&#x43E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#xAB;&#x437;&#x430;&#x445;&#x43B;&#x430;&#x43C;&#x43B;&#x44F;&#x435;&#x442;&#xBB; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x442;&#x43A;&#x443;, &#x43D;&#x43E; &#x437;&#x430;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43A;&#x440;&#x443;&#x442;&#x44B;&#x435; &#x432;&#x435;&#x449;&#x438;.
&#x421;&#x43C;&#x435;&#x43D;&#x430; &#x446;&#x432;&#x435;&#x442;&#x430; &#x438;&#x43A;&#x43E;&#x43D;&#x43E;&#x43A; &#x438;&#x437; &#x441;&#x442;&#x438;&#x43B;&#x435;&#x439;, SMIL-&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x446;&#x438;&#x44F;.
&#x41F;&#x43E; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x43E;&#x434;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x442;&#x44C; &#x43B;&#x435;&#x43A;&#x446;&#x438;&#x44E; <a href="http://video.yandex.ru/users/ya-events/view/3228" target="_blank">http://video.yandex.ru/users/ya-events/view/3228</a>.
&#x422;&#x435;&#x43C; &#x431;&#x43E;&#x43B;&#x435;&#x435;, SVG &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x441;&#x435;&#x43C;&#x438; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;&#x43C;&#x438;.
&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x435;&#x441;&#x442;&#x44C; &#x43B;&#x438;&#x448;&#x44C; &#x432; IE8 &#x438; Android 2.3.
&#x41D;&#x43E; &#x44D;&#x442;&#x43E; &#x440;&#x435;&#x448;&#x430;&#x435;&#x43C;&#x43E; &#x438;&#x437;&#x44F;&#x449;&#x43D;&#x44B;&#x43C; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x435;&#x43C; &#x2014; &#x43D;&#x430;&#x432;&#x435;&#x448;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x444;&#x43E;&#x43D;&#x430; &#x43D;&#x430; <code><span class="token tag"><span class="token tag"><span class="token punctuation">&lt;</span>svg</span><span class="token punctuation">&gt;</span></span></code> &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;.
&#x410; &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x438;&#x438; SVG &#x432; PNG &#x435;&#x441;&#x442;&#x44C; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x435; Grunt-&#x437;&#x430;&#x434;&#x430;&#x447;&#x438;.</p>
<h2 id="&#x43C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F;-svg">&#x41C;&#x438;&#x43D;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; SVG</h2>
<p>&#x414;&#x43B;&#x44F; SVG &#x435;&#x441;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x44B;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x2014; <a href="https://github.com/svg/svgo" target="_blank">SVGO</a>.
&#x41A;&#x430;&#x43A; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x43A;&#x430;, &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43B;&#x44E;&#x431;&#x430;&#x44F; &#x438;&#x43A;&#x43E;&#x43D;&#x43A;&#x430; &#x443;&#x436;&#x438;&#x43C;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x434;&#x432;&#x43E;&#x435;, &#x431;&#x44B;&#x43B;&#x438; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x438; &#x441; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x438; &#x43D;&#x430; 90%.
&#x41D;&#x43E; &#x441; SVGO &#x441;&#x442;&#x43E;&#x438;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x44B;&#x43C; &#x2014; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x435; SVG &#x43E;&#x43D; &#x43F;&#x43E;&#x440;&#x442;&#x438;&#x442;.
&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x430; &#x438;&#x437; &#x440;&#x435;&#x434;&#x430;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; SVG &#x435;&#x441;&#x442;&#x44C; &#x43A;&#x443;&#x447;&#x430; &#x43D;&#x435;&#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430;, &#x43D;&#x43E; SVGO &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43B;&#x438;&#x448;&#x43D;&#x435;&#x435;.
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, Sketch &#x43F;&#x440;&#x438; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x435; SVG &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x434;&#x432;&#x435; &#x43B;&#x438;&#x448;&#x43D;&#x438;&#x445; &#x43E;&#x431;&#x435;&#x440;&#x442;&#x43A;&#x438; <code><span class="token tag"><span class="token tag"><span class="token punctuation">&lt;</span>g</span><span class="token punctuation">&gt;</span></span></code>,
&#x43D;&#x430; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x435; &#x43C;&#x435;&#x448;&#x430;&#x435;&#x442; &#x430;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x44B; &#x438;&#x437; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x441;&#x43A;&#x435;&#x442;&#x447;&#x430; (&#x43D;&#x443; &#x438; &#x441;&#x430;&#x43C;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;).
&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x435;&#x442; &#x438; Adobe Illustrator.
&#x41F;&#x43E;-&#x445;&#x43E;&#x440;&#x43E;&#x448;&#x435;&#x43C;&#x443;, &#x432;&#x441;&#x451; &#x43B;&#x438;&#x448;&#x43D;&#x435;&#x435; &#x443;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x438; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x447;&#x435;&#x440;&#x435;&#x437; SVGO.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="CSS/Stylus.html" class="navigation navigation-prev " aria-label="Previous page: Stylus">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="JavaScript/Readme.html" class="navigation navigation-next " aria-label="Next page: JavaScript">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Изображения","level":"1.4","depth":1,"next":{"title":"JavaScript","level":"1.5","depth":1,"path":"JavaScript/Readme.md","ref":"./JavaScript/Readme.md","articles":[{"title":"Библиотеки","level":"1.5.1","depth":2,"path":"JavaScript/Plugins.md","ref":"./JavaScript/Plugins.md","articles":[]}]},"previous":{"title":"Stylus","level":"1.3.2","depth":2,"path":"CSS/Stylus.md","ref":"./CSS/Stylus.md","articles":[]},"dir":"ltr"},"config":{"plugins":["edit-link","prism","-highlight","github","anchorjs"],"root":"./docs","styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"github":{"url":"https://github.com/reactjs/redux/"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edit This Page","base":"https://github.com/CSSSR/sputnik/blob/develop/docs"},"theme-default":{"styles":{"website":"build/gitbook.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"anchorjs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Sputnik","gitbook":">=3.2.1"},"file":{"path":"Images.md","mtime":"2016-11-15T16:38:56.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2016-11-17T15:28:09.552Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/anchor-js/3.1.1/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-anchorjs/anchor-style.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

